In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
s_abb = pd.read_csv('data-USstates/state-abbrevs.csv')

# areas
s_areas = pd.read_csv('data-USstates/state-areas.csv')
s_pop = pd.read_csv('data-USstates/state-population.csv')
display(s_abb.head(), s_areas.tail(), s_pop.head(), s_pop.shape)

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

                   state  area (sq. mi)
47         West Virginia          24231
48             Wisconsin          65503
49               Wyoming          97818
50  District of Columbia             68
51           Puerto Rico           3515

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

(2544, 4)

将各州人口数据补全：地区，缩写全部补上

In [3]:
pop = pd.merge(s_pop, s_abb, left_on='state/region', right_on='abbreviation', how='outer')
pop.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [4]:
# delete abbreviation,axis = 1
pop.drop('abbreviation', axis=1, inplace=True)

In [5]:
pop.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [6]:
# check out if number is null
pop.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [7]:
df_lost = pop.loc[pop['state'].isnull()]

In [8]:
# 重复项只记一次，放入
df_lost['state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [9]:
pr = (pop['state/region'] == 'PR')
pop['state'][pr] = 'PUERTO RICO'
pr = (pop['state/region'] == 'USA')
pop['state'][pr] = 'United States of America'

/home/luyuxuan/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/home/luyuxuan/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

In [10]:
pop.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

合并各州面积数据

In [11]:
# pop 数据完整，所以左合并
pop2 = pd.merge(pop, s_areas, how='left')

In [12]:
pop2.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [13]:
pop2[pop2['area (sq. mi)'].isnull()]['state']
pop2.shape

(2544, 6)

In [14]:
pop3 = pop2.dropna()
pop3.shape

(2448, 6)

In [15]:
pop3.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)    False
dtype: bool

In [16]:
pop3.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [17]:
# query为查询语句,查询2010年全年龄段的人口数据
pop_2010 = pop3.query("year == 2010 & ages == 'total'")

In [18]:
# 由于索引是乱的，所以根据state重新更新索引
pop_2010.set_index('state',inplace=True)

In [20]:
pop_density = pop_2010['population'] / pop_2010['area (sq. mi)']
pop_density.head()
pop_d = DataFrame(pop_density, columns = ['pop_density'])
pop_d.head()

            pop_density
state
Alabama       91.287603
Alaska         1.087509
Arizona       56.214497
Arkansas      54.948667
California   228.051342

In [21]:
pop_density.sort_values(ascending=False, inplace = True)

现在将得到的人口密度回加到pop3中

In [22]:
display(pop3.head(), pop_d.head())

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

            pop_density
state
Alabama       91.287603
Alaska         1.087509
Arizona       56.214497
Arkansas      54.948667
California   228.051342

In [23]:
pd.merge(pop3, pop_d, left_on='state', right_on='state')
display(pop3.head(),  )

,state/region,ages,year,population,state,area (sq. mi),pop_density
0,AL,under18,2012,1117489.0,Alabama,52423.0,91.287603
1,AL,total,2012,4817528.0,Alabama,52423.0,91.287603
2,AL,under18,2010,1130966.0,Alabama,52423.0,91.287603
3,AL,total,2010,4785570.0,Alabama,52423.0,91.287603
4,AL,under18,2011,1125763.0,Alabama,52423.0,91.287603
5,AL,total,2011,4801627.0,Alabama,52423.0,91.287603
6,AL,total,2009,4757938.0,Alabama,52423.0,91.287603
7,AL,under18,2009,1134192.0,Alabama,52423.0,91.287603
8,AL,under18,2013,1111481.0,Alabama,52423.0,91.287603
9,AL,total,2013,4833722.0,Alabama,52423.0,91.287603
10,AL,total,2007,4672840.0,Alabama,52423.0,91.287603
11,AL,under18,2007,1132296.0,Alabama,52423.0,91.287603
12,AL,total,2008,4718206.0,Alabama,52423.0,91.287603
13,AL,under18,2008,1134927.0,Alabama,52423.0,91.287603
14,AL,total,2005,4569805.0,Alabama,52423.0,91.287603
15,AL,under18,2005,1117229.0,Alabama,52423.0,91.287603
16,AL,total,2006,4628981.0,Alabama,52423.0,91.287603
17,AL,under18,2006,1126798.0,Alabama,52423.0,91.287603
18,AL,total,2004,4530729.0,Alabama,52423.0,91.287603
19,AL,under18,2004,1113662.0,Alabama,52423.0,91.287603
20,AL,total,2003,4503491.0,Alabama,52423.0,91.287603
21,AL,under18,2003,1113083.0,Alabama,52423.0,91.287603
22,AL,total,2001,4467634.0,Alabama,52423.0,91.287603
23,AL,under18,2001,1120409.0,Alabama,52423.0,91.287603
24,AL,total,2002,4480089.0,Alabama,52423.0,91.287603
25,AL,under18,2002,1116590.0,Alabama,52423.0,91.287603
26,AL,under18,1999,1121287.0,Alabama,52423.0,91.287603
27,AL,total,1999,4430141.0,Alabama,52423.0,91.287603
28,AL,total,2000,4452173.0,Alabama,52423.0,91.287603
29,AL,under18,2000,1122273.0,Alabama,52423.0,91.287603
...,...,...,...,...,...,...,...
2418,WY,total,2003,503453.0,Wyoming,97818.0,5.768079
2419,WY,under18,2003,124182.0,Wyoming,97818.0,5.768079
2420,WY,total,2004,509106.0,Wyoming,97818.0,5.768079
2421,WY,under18,2004,123974.0,Wyoming,97818.0,5.768079
2422,WY,total,2002,500017.0,Wyoming,97818.0,5.768079
2423,WY,under18,2002,125495.0,Wyoming,97818.0,5.768079
2424,WY,total,2001,494657.0,Wyoming,97818.0,5.768079
2425,WY,under18,2001,126212.0,Wyoming,97818.0,5.768079
2426,WY,total,2000,494300.0,Wyoming,97818.0,5.768079
2427,WY,under18,2000,128774.0,Wyoming,97818.0,5.768079
2428,WY,total,1999,491780.0,Wyoming,97818.0,5.768079
2429,WY,under18,1999,130793.0,Wyoming,97818.0,5.768079
2430,WY,total,1997,489452.0,Wyoming,97818.0,5.768079
2431,WY,under18,1997,134328.0,Wyoming,97818.0,5.768079
2432,WY,under18,1998,132602.0,Wyoming,97818.0,5.768079
2433,WY,total,1998,490787.0,Wyoming,97818.0,5.768079
2434,WY,under18,1996,135698.0,Wyoming,97818.0,5.768079
2435,WY,total,1996,488167.0,Wyoming,97818.0,5.768079
2436,WY,total,1995,485160.0,Wyoming,97818.0,5.768079
2437,WY,under18,1995,136785.0,Wyoming,97818.0,5.768079
2438,WY,under18,1994,137733.0,Wyoming,97818.0,5.768079
2439,WY,total,1994,480283.0,Wyoming,97818.0,5.768079
2440,WY,under18,1992,137308.0,Wyoming,97818.0,5.768079
2441,WY,total,1992,466251.0,Wyoming,97818.0,5.768079
2442,WY,total,1993,473081.0,Wyoming,97818.0,5.768079
2443,WY,under18,1993,137458.0,Wyoming,97818.0,5.768079
2444,WY,total,1991,459260.0,Wyoming,97818.0,5.768079
2445,WY,under18,1991,136720.0,Wyoming,97818.0,5.768079
2446,WY,under18,1990,136078.0,Wyoming,97818.0,5.768079
2447,WY,total,1990,453690.0,Wyoming,97818.0,5.768079